{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_1",
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            null,
            47
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "lstm_2_input"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "LSTM",
        "config": {
          "name": "lstm_2",
          "trainable": true,
          "dtype": "float32",
          "batch_input_shape": [
            null,
            null,
            47
          ],
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 256,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "RandomNormal",
            "config": {
              "mean": 0.0,
              "stddev": 0.05,
              "seed": 71
            },
            "registered_name": null
          },
          "recurrent_initializer": {
            "module": "keras.initializers",
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.3,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            null,
            47
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "LSTM",
        "config": {
          "name": "lstm_3",
          "trainable": true,
          "dtype": "float32",
          "batch_input_shape": [
            null,
            null,
            47
          ],
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 256,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "RandomNormal",
            "config": {
              "mean": 0.0,
              "stddev": 0.05,
              "seed": 71
            },
            "registered_name": null
          },
          "recurrent_initializer": {
            "module": "keras.initializers",
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.5,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            null,
            256
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": "float32",
          "units": 47,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "RandomNormal",
            "config": {
              "mean": 0.0,
              "stddev": 0.05,
              "seed": 71
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            null,
            256
          ]
        }
      }
    ]
  },
  "keras_version": "2.13.1",
  "backend": "tensorflow"
}